// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное само на себя)

// например:
//  4 -> 16
//  -3 -> 9
//  -7 -> 49

Console.Write("Введите число: ");
 int num = Convert.ToInt32(Console.ReadLine());
int num2 = num * num;

Console.Write($"квадрат числа {num * num}");
